tap "daipeihust/tap"
tap "heroku/brew"
# Switch input method (IME) from the command line — used by nvim/vim IME auto-switch
brew "daipeihust/tap/im-select"
# Heroku CLI
brew "heroku/brew/heroku"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Command-line fuzzy finder written in Go
brew "fzf"
# Recursively search directories for a regex pattern (nvim/telescope live grep)
brew "ripgrep"
# Fast, user-friendly alternative to find (nvim/telescope file search, fzf)
brew "fd"
# Simple terminal UI for git — used as a tmux popup (prefix+g) and via nvim snacks
brew "lazygit"
# Mobile shell: survives Wi-Fi/cellular roaming and sleep (iPad/Blink -> Mac mini)
brew "mosh"
# Syntax-highlighting pager for richer git/diff output
brew "git-delta"
# GitHub CLI — PRs, issues, gh auth; also powers Claude Code's PR status indicator
brew "gh"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Node.js version manager
brew "nodebrew"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Memory training application
cask "anki"
# Terminal emulator (replaces Hyper; config in iterm2/ + config/colors/)
cask "iterm2"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# System monitoring menu-bar app (license key entered manually after install)
cask "istat-menus@6"
# Container runtime / Docker Desktop
cask "docker-desktop"
# Team chat & meetings
cask "microsoft-teams"
# Video conferencing
cask "zoom"
# Drag-to-uninstall apps
cask "appcleaner"
# Claude desktop app
cask "claude"
# Claude Code CLI (stable channel). Drives the tmux/Remote Control workflow.
# No auto-update via brew; set CLAUDE_CODE_PACKAGE_MANAGER_AUTO_UPDATE=1 to let
# Claude Code self-upgrade through brew, or run `brew upgrade claude-code`.
cask "claude-code"
# Keyboard customizer (config in config/karabiner/)
cask "karabiner-elements"
# Logitech mouse/keyboard settings
cask "logi-options+"
# Fonts — required by iTerm2 / VSCode terminal (SauceCodePro Nerd Font Mono),
# VSCode editor (Source Code Pro), and powerlevel10k glyphs. Without these the
# prompt icons render as tofu/garbled boxes.
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-meslo-lg-nerd-font"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-preview-github-styles"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
