tap "daipeihust/tap"
tap "heroku/brew"
# Switch input method (IME) from the command line — used by nvim/vim IME auto-switch
brew "daipeihust/tap/im-select"
# Heroku CLI
brew "heroku/brew/heroku"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Shell extension to jump to frequently used directories
brew "autojump"
# Command-line fuzzy finder written in Go
brew "fzf"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Node.js version manager
brew "nodebrew"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@17"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# Memory training application
cask "anki"
# Voice and text chat software
cask "discord"
# Terminal built on web technologies
cask "hyper"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# Fonts — required by iTerm2 / VSCode terminal (SauceCodePro Nerd Font Mono),
# VSCode editor (Source Code Pro), and powerlevel10k glyphs. Without these the
# prompt icons render as tofu/garbled boxes.
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-meslo-lg-nerd-font"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-preview-github-styles"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
npm "corepack"
