asvetliakov.vscode-neovim
bierner.markdown-preview-github-styles
docker.docker
eamodio.gitlens
github.copilot
github.copilot-chat
humao.rest-client
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.flake8
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
sdras.night-owl
streetsidesoftware.code-spell-checker
